import React from "react";
import "../styles/articleStyle.css";
import { useParams, Link } from "react-router-dom";

const articles = [
  {
    title: "مقاله‌ای در مورد رستگاری",
    date: "24 بهمن 1403",
    author: "مسعود نعمتی",
    content: "در این مقاله، ما به بررسی مفهوم رستگاری می‌پردازیم. <strong>رستگاری</strong> یکی از مفاهیم اصلی در دین مسیحیت است که به <b>آزادی از گناه</b> و <em>پیوستن به خدا</em> اشاره دارد."
  },
  {
    title: "مقاله‌ای در مورد نجات",
    date: "25 بهمن 1403",
    author: "مسعود نعمتی",
    content: "نجات یک فرآیند <strong>روحانی</strong> است که فرد را از خطای انسان‌ها و از مجازات گناه می‌رهاند. در این مقاله به چگونگی نجات در مسیحیت پرداخته می‌شود."
  },
  {
    title: "مقاله‌ای در مورد ایمان",
    date: "26 بهمن 1403",
    author: "مسعود نعمتی",
    content: `
    
     <section>
        <h2>مقدمه</h2>
        <p>
            موضوعی که در اینجا مطرح شده نقش انبیا در اصلاح پادشاهان و مردم است. آیا انبیا همیشه به پادشاهان هشدار می‌دادند و آنها توبیخ می‌کردند و یا اینکه گاهی مشوق و حامی پادشاهان بودند؟ خیلی مهم است که بدانیم کار انبیا چه بوده است. انبیا سخن‌گویان خداوند بودند و وظیفه و نقش آنها انتقال پیام خدا، اصلاح و هدایت پادشاهان و مردم را در مسیر صحیح بر عهده داشتند.
        </p>
        <p>
            به عنوان مثال به عنوان پدر خانواده یا رهبر، همانطور که ما فرزندانمان را برای اینکه بتوانیم تربیت کنیم و به مسیرهای صحیح هدایت کنیم، در اکثر مواقع آنها را توبیخ و تنبیه می‌کنیم تا راه صحیح را پیدا کنند و بخاطر عشق، محبت و دوست داشتن همه این کارها را انجام می‌دهیم و بعضی مواقع آنها را حمایت و تشویق می‌کنیم. خدا هم به خاطر عشق، محبت و بخشش که نسبت به پادشاهان و مردم دارد، برای اینکه در مسیر درست حرکت کنند و از گناه دوری کنند، برای اصلاح پادشاهان و مردم را توبیخ، تنبیه، تشویق و حمایت می‌کند.
        </p>
        <p>
            بنابرین انبیای عهد عتیق نیز همین کار را انجام و راهنمایی می‌کنند که در روابط با خداوند و همدیگر، عدالت، بخشش و اخلاق را رعایت کنیم و جوامعی عادلانه و معتدل را بسازند. لذا در این مقاله، به بررسی این نقش و تأثیر انبیا برای اصلاح پادشاهان و مردم خواهیم پرداخت.
        </p>
    </section>

    <section>
        <h2>انتخاب پادشاه</h2>
        <p>
            با مطالعه کتاب مقدس از پیدایش تا زمان سموئیل نبی رهبری قوم را خود خدا بر عهد داشت و پادشاهی وجود نداشت و با معجزات و کارهای عظیمی که برای قوم اسرائیل انجام داد به خوبی نمایان است که همه چیز در دست اوست و قدرت اول تمام قدرت‌هاست.
        </p>
        <p>
            یکی از شخصیت‌های مهم کتاب مقدس موسی است. به عنوان رهبر قوم اسرائیل توسط خدا انتخاب شد تا قوم را از مصر بیرون کند و دستورات و فرامین الهی را از خدا دریافت کرد تا به مردم اسرائیل انتقال دهد و شخصیت‌های مهم دیگری نیز به عنوان رهبر مانند نوح، ابراهیم، اسحاق، یعقوب، داود بودند که خدا آنها را برگزید تا قوم را با دستورات و فرامین الهی هدایت کنند.
        </p>
        <p>
            در کتاب اول سموئیل می‌خوانیم خداوند سموئیل را صدا می‌زند (اول سموئیل 1:3-19). سموئیل اولین نبی است که خداوند او را فراخواند برای اصلاح و هدایت قوم اسرائیل.
        </p>
    </section>

    <section>
        <h2>توبیخ پادشاهان</h2>
        <p>
            همانطور که در مقدمه اشاره شد، خدا برای تربیت قوم و مردم در بیشتر مواقع پادشاهان را توسط انبیا توبیخ و تنبیه می‌کرد تا آنها به اشتباهات خود پی ببرند و به سوی فرمان‌های الهی بازگشت کنند.
        </p>
        <h3>توبیخ پادشاه آخاب</h3>
        <p>
            پادشاهی آخاب در زمان ایلیای نبی و الیشع بود. آخاب و همسرش ایزابل هر آن چیزی که از نظر خدا بد بود را انجام می‌دادند. آخاب به دلیل اعمال نادرست و گناهانی که در مقابل خداوند ارتکاب می‌کرد، آنها به وسیله تبعیض و ستم به مردم، خرابکاری در عبادت و پیروی از خدای بتان، و کشتن انبیا و پیروان خدا مرتکب گناه می‌شدند و توسط ایلیای نبی توبیخ شدند.
        </p>
    </section>

    <section>
        <h2>تشویق پادشاهان و مردم</h2>
        <p>
            در عهد عتیق انبیا پادشاهان را نیز تشویق می‌کردند. سموئیل و ناتان داود را به پیروی از خداوند و رفتار صالحانه تشویق کرده‌اند و یادآوری می‌کردند پادشاهی آنها انتخاب خداوند بوده و به پیروی فرمان‌های خداوند و عدالت و پرهیز از گناهان تشویق و هدایت می‌کردند.
        </p>
        <h3>تشویق اشعیا به پادشاهان</h3>
        <p>
            اشعیا نبی در تمام طول دوران حکومت پادشاهان مختلف در عهد عتیق تشویق و هدایت می‌کرد. مانند پادشاهانی که عبارتند از: عزیا، یوتام، آحاز، حزقیا. در زمان پادشاهی حزقیا در دوم پادشاهان باب 18 تهدیدهایی از سوی پادشاه آشور متوجه مردم یهودا شده بود و اشعیا نبی او را تشویق می‌کرد که نترسد و به خدا ایمان داشته باشد و به او توکل کنند.
        </p>
    </section>

    <section>
        <h2>نبوت انبیا</h2>
        <p>
            یکی دیگر از نقش‌های انبیا عهد عتیق نبوت بود. نبوت در اساسی‌ترین معنا پیام خداست و از این رو نبوت به معنای اعلام پیامی از جانب خداوند است.
        </p>
        <p>
            نبوت‌ها در عهد عتیق برای هدایت مردم به راه صحیح و انتخاب اعمال نیکو بکار می‌رفتند. انبیا به مردم اسرائیل شریعت خداوند را تعلیم می‌دادند و آنها را به رعایت دستورات الهی، اخلاق صالح و عبادت صحیح به اصلاح و توبه تشویق می‌کردند.
        </p>
    </section>
    

    
    `
  },
  {
    title: "مقاله‌ای در مورد ایمان",
    date: "26 بهمن 1403",
    author: "مسعود نعمتی",
    content: `
    
     <section>
        <h2>مقدمه</h2>
        <p>
            موضوعی که در اینجا مطرح شده نقش انبیا در اصلاح پادشاهان و مردم است. آیا انبیا همیشه به پادشاهان هشدار می‌دادند و آنها توبیخ می‌کردند و یا اینکه گاهی مشوق و حامی پادشاهان بودند؟ خیلی مهم است که بدانیم کار انبیا چه بوده است. انبیا سخن‌گویان خداوند بودند و وظیفه و نقش آنها انتقال پیام خدا، اصلاح و هدایت پادشاهان و مردم را در مسیر صحیح بر عهده داشتند.
        </p>
        <p>
            به عنوان مثال به عنوان پدر خانواده یا رهبر، همانطور که ما فرزندانمان را برای اینکه بتوانیم تربیت کنیم و به مسیرهای صحیح هدایت کنیم، در اکثر مواقع آنها را توبیخ و تنبیه می‌کنیم تا راه صحیح را پیدا کنند و بخاطر عشق، محبت و دوست داشتن همه این کارها را انجام می‌دهیم و بعضی مواقع آنها را حمایت و تشویق می‌کنیم. خدا هم به خاطر عشق، محبت و بخشش که نسبت به پادشاهان و مردم دارد، برای اینکه در مسیر درست حرکت کنند و از گناه دوری کنند، برای اصلاح پادشاهان و مردم را توبیخ، تنبیه، تشویق و حمایت می‌کند.
        </p>
        <p>
            بنابرین انبیای عهد عتیق نیز همین کار را انجام و راهنمایی می‌کنند که در روابط با خداوند و همدیگر، عدالت، بخشش و اخلاق را رعایت کنیم و جوامعی عادلانه و معتدل را بسازند. لذا در این مقاله، به بررسی این نقش و تأثیر انبیا برای اصلاح پادشاهان و مردم خواهیم پرداخت.
        </p>
    </section>

    <section>
        <h2>انتخاب پادشاه</h2>
        <p>
            با مطالعه کتاب مقدس از پیدایش تا زمان سموئیل نبی رهبری قوم را خود خدا بر عهد داشت و پادشاهی وجود نداشت و با معجزات و کارهای عظیمی که برای قوم اسرائیل انجام داد به خوبی نمایان است که همه چیز در دست اوست و قدرت اول تمام قدرت‌هاست.
        </p>
        <p>
            یکی از شخصیت‌های مهم کتاب مقدس موسی است. به عنوان رهبر قوم اسرائیل توسط خدا انتخاب شد تا قوم را از مصر بیرون کند و دستورات و فرامین الهی را از خدا دریافت کرد تا به مردم اسرائیل انتقال دهد و شخصیت‌های مهم دیگری نیز به عنوان رهبر مانند نوح، ابراهیم، اسحاق، یعقوب، داود بودند که خدا آنها را برگزید تا قوم را با دستورات و فرامین الهی هدایت کنند.
        </p>
        <p>
            در کتاب اول سموئیل می‌خوانیم خداوند سموئیل را صدا می‌زند (اول سموئیل 1:3-19). سموئیل اولین نبی است که خداوند او را فراخواند برای اصلاح و هدایت قوم اسرائیل.
        </p>
    </section>

    <section>
        <h2>توبیخ پادشاهان</h2>
        <p>
            همانطور که در مقدمه اشاره شد، خدا برای تربیت قوم و مردم در بیشتر مواقع پادشاهان را توسط انبیا توبیخ و تنبیه می‌کرد تا آنها به اشتباهات خود پی ببرند و به سوی فرمان‌های الهی بازگشت کنند.
        </p>
        <h3>توبیخ پادشاه آخاب</h3>
        <p>
            پادشاهی آخاب در زمان ایلیای نبی و الیشع بود. آخاب و همسرش ایزابل هر آن چیزی که از نظر خدا بد بود را انجام می‌دادند. آخاب به دلیل اعمال نادرست و گناهانی که در مقابل خداوند ارتکاب می‌کرد، آنها به وسیله تبعیض و ستم به مردم، خرابکاری در عبادت و پیروی از خدای بتان، و کشتن انبیا و پیروان خدا مرتکب گناه می‌شدند و توسط ایلیای نبی توبیخ شدند.
        </p>
    </section>

    <section>
        <h2>تشویق پادشاهان و مردم</h2>
        <p>
            در عهد عتیق انبیا پادشاهان را نیز تشویق می‌کردند. سموئیل و ناتان داود را به پیروی از خداوند و رفتار صالحانه تشویق کرده‌اند و یادآوری می‌کردند پادشاهی آنها انتخاب خداوند بوده و به پیروی فرمان‌های خداوند و عدالت و پرهیز از گناهان تشویق و هدایت می‌کردند.
        </p>
        <h3>تشویق اشعیا به پادشاهان</h3>
        <p>
            اشعیا نبی در تمام طول دوران حکومت پادشاهان مختلف در عهد عتیق تشویق و هدایت می‌کرد. مانند پادشاهانی که عبارتند از: عزیا، یوتام، آحاز، حزقیا. در زمان پادشاهی حزقیا در دوم پادشاهان باب 18 تهدیدهایی از سوی پادشاه آشور متوجه مردم یهودا شده بود و اشعیا نبی او را تشویق می‌کرد که نترسد و به خدا ایمان داشته باشد و به او توکل کنند.
        </p>
    </section>

    <section>
        <h2>نبوت انبیا</h2>
        <p>
            یکی دیگر از نقش‌های انبیا عهد عتیق نبوت بود. نبوت در اساسی‌ترین معنا پیام خداست و از این رو نبوت به معنای اعلام پیامی از جانب خداوند است.
        </p>
        <p>
            نبوت‌ها در عهد عتیق برای هدایت مردم به راه صحیح و انتخاب اعمال نیکو بکار می‌رفتند. انبیا به مردم اسرائیل شریعت خداوند را تعلیم می‌دادند و آنها را به رعایت دستورات الهی، اخلاق صالح و عبادت صحیح به اصلاح و توبه تشویق می‌کردند.
        </p>
    </section>
    

    
    `
  },
  {
    title: "مقاله‌ای در مورد ایمان",
    date: "26 بهمن 1403",
    author: "مسعود نعمتی",
    content: `
    
     <section>
        <h2>مقدمه</h2>
        <p>
            موضوعی که در اینجا مطرح شده نقش انبیا در اصلاح پادشاهان و مردم است. آیا انبیا همیشه به پادشاهان هشدار می‌دادند و آنها توبیخ می‌کردند و یا اینکه گاهی مشوق و حامی پادشاهان بودند؟ خیلی مهم است که بدانیم کار انبیا چه بوده است. انبیا سخن‌گویان خداوند بودند و وظیفه و نقش آنها انتقال پیام خدا، اصلاح و هدایت پادشاهان و مردم را در مسیر صحیح بر عهده داشتند.
        </p>
        <p>
            به عنوان مثال به عنوان پدر خانواده یا رهبر، همانطور که ما فرزندانمان را برای اینکه بتوانیم تربیت کنیم و به مسیرهای صحیح هدایت کنیم، در اکثر مواقع آنها را توبیخ و تنبیه می‌کنیم تا راه صحیح را پیدا کنند و بخاطر عشق، محبت و دوست داشتن همه این کارها را انجام می‌دهیم و بعضی مواقع آنها را حمایت و تشویق می‌کنیم. خدا هم به خاطر عشق، محبت و بخشش که نسبت به پادشاهان و مردم دارد، برای اینکه در مسیر درست حرکت کنند و از گناه دوری کنند، برای اصلاح پادشاهان و مردم را توبیخ، تنبیه، تشویق و حمایت می‌کند.
        </p>
        <p>
            بنابرین انبیای عهد عتیق نیز همین کار را انجام و راهنمایی می‌کنند که در روابط با خداوند و همدیگر، عدالت، بخشش و اخلاق را رعایت کنیم و جوامعی عادلانه و معتدل را بسازند. لذا در این مقاله، به بررسی این نقش و تأثیر انبیا برای اصلاح پادشاهان و مردم خواهیم پرداخت.
        </p>
    </section>

    <section>
        <h2>انتخاب پادشاه</h2>
        <p>
            با مطالعه کتاب مقدس از پیدایش تا زمان سموئیل نبی رهبری قوم را خود خدا بر عهد داشت و پادشاهی وجود نداشت و با معجزات و کارهای عظیمی که برای قوم اسرائیل انجام داد به خوبی نمایان است که همه چیز در دست اوست و قدرت اول تمام قدرت‌هاست.
        </p>
        <p>
            یکی از شخصیت‌های مهم کتاب مقدس موسی است. به عنوان رهبر قوم اسرائیل توسط خدا انتخاب شد تا قوم را از مصر بیرون کند و دستورات و فرامین الهی را از خدا دریافت کرد تا به مردم اسرائیل انتقال دهد و شخصیت‌های مهم دیگری نیز به عنوان رهبر مانند نوح، ابراهیم، اسحاق، یعقوب، داود بودند که خدا آنها را برگزید تا قوم را با دستورات و فرامین الهی هدایت کنند.
        </p>
        <p>
            در کتاب اول سموئیل می‌خوانیم خداوند سموئیل را صدا می‌زند (اول سموئیل 1:3-19). سموئیل اولین نبی است که خداوند او را فراخواند برای اصلاح و هدایت قوم اسرائیل.
        </p>
    </section>

    <section>
        <h2>توبیخ پادشاهان</h2>
        <p>
            همانطور که در مقدمه اشاره شد، خدا برای تربیت قوم و مردم در بیشتر مواقع پادشاهان را توسط انبیا توبیخ و تنبیه می‌کرد تا آنها به اشتباهات خود پی ببرند و به سوی فرمان‌های الهی بازگشت کنند.
        </p>
        <h3>توبیخ پادشاه آخاب</h3>
        <p>
            پادشاهی آخاب در زمان ایلیای نبی و الیشع بود. آخاب و همسرش ایزابل هر آن چیزی که از نظر خدا بد بود را انجام می‌دادند. آخاب به دلیل اعمال نادرست و گناهانی که در مقابل خداوند ارتکاب می‌کرد، آنها به وسیله تبعیض و ستم به مردم، خرابکاری در عبادت و پیروی از خدای بتان، و کشتن انبیا و پیروان خدا مرتکب گناه می‌شدند و توسط ایلیای نبی توبیخ شدند.
        </p>
    </section>

    <section>
        <h2>تشویق پادشاهان و مردم</h2>
        <p>
            در عهد عتیق انبیا پادشاهان را نیز تشویق می‌کردند. سموئیل و ناتان داود را به پیروی از خداوند و رفتار صالحانه تشویق کرده‌اند و یادآوری می‌کردند پادشاهی آنها انتخاب خداوند بوده و به پیروی فرمان‌های خداوند و عدالت و پرهیز از گناهان تشویق و هدایت می‌کردند.
        </p>
        <h3>تشویق اشعیا به پادشاهان</h3>
        <p>
            اشعیا نبی در تمام طول دوران حکومت پادشاهان مختلف در عهد عتیق تشویق و هدایت می‌کرد. مانند پادشاهانی که عبارتند از: عزیا، یوتام، آحاز، حزقیا. در زمان پادشاهی حزقیا در دوم پادشاهان باب 18 تهدیدهایی از سوی پادشاه آشور متوجه مردم یهودا شده بود و اشعیا نبی او را تشویق می‌کرد که نترسد و به خدا ایمان داشته باشد و به او توکل کنند.
        </p>
    </section>

    <section>
        <h2>نبوت انبیا</h2>
        <p>
            یکی دیگر از نقش‌های انبیا عهد عتیق نبوت بود. نبوت در اساسی‌ترین معنا پیام خداست و از این رو نبوت به معنای اعلام پیامی از جانب خداوند است.
        </p>
        <p>
            نبوت‌ها در عهد عتیق برای هدایت مردم به راه صحیح و انتخاب اعمال نیکو بکار می‌رفتند. انبیا به مردم اسرائیل شریعت خداوند را تعلیم می‌دادند و آنها را به رعایت دستورات الهی، اخلاق صالح و عبادت صحیح به اصلاح و توبه تشویق می‌کردند.
        </p>
    </section>
    

    
    `
  },
  {
    title: "مقاله‌ای در مورد ایمان",
    date: "26 بهمن 1403",
    author: "مسعود نعمتی",
    content: `
    
     <section>
        <h2>مقدمه</h2>
        <p>
            موضوعی که در اینجا مطرح شده نقش انبیا در اصلاح پادشاهان و مردم است. آیا انبیا همیشه به پادشاهان هشدار می‌دادند و آنها توبیخ می‌کردند و یا اینکه گاهی مشوق و حامی پادشاهان بودند؟ خیلی مهم است که بدانیم کار انبیا چه بوده است. انبیا سخن‌گویان خداوند بودند و وظیفه و نقش آنها انتقال پیام خدا، اصلاح و هدایت پادشاهان و مردم را در مسیر صحیح بر عهده داشتند.
        </p>
        <p>
            به عنوان مثال به عنوان پدر خانواده یا رهبر، همانطور که ما فرزندانمان را برای اینکه بتوانیم تربیت کنیم و به مسیرهای صحیح هدایت کنیم، در اکثر مواقع آنها را توبیخ و تنبیه می‌کنیم تا راه صحیح را پیدا کنند و بخاطر عشق، محبت و دوست داشتن همه این کارها را انجام می‌دهیم و بعضی مواقع آنها را حمایت و تشویق می‌کنیم. خدا هم به خاطر عشق، محبت و بخشش که نسبت به پادشاهان و مردم دارد، برای اینکه در مسیر درست حرکت کنند و از گناه دوری کنند، برای اصلاح پادشاهان و مردم را توبیخ، تنبیه، تشویق و حمایت می‌کند.
        </p>
        <p>
            بنابرین انبیای عهد عتیق نیز همین کار را انجام و راهنمایی می‌کنند که در روابط با خداوند و همدیگر، عدالت، بخشش و اخلاق را رعایت کنیم و جوامعی عادلانه و معتدل را بسازند. لذا در این مقاله، به بررسی این نقش و تأثیر انبیا برای اصلاح پادشاهان و مردم خواهیم پرداخت.
        </p>
    </section>

    <section>
        <h2>انتخاب پادشاه</h2>
        <p>
            با مطالعه کتاب مقدس از پیدایش تا زمان سموئیل نبی رهبری قوم را خود خدا بر عهد داشت و پادشاهی وجود نداشت و با معجزات و کارهای عظیمی که برای قوم اسرائیل انجام داد به خوبی نمایان است که همه چیز در دست اوست و قدرت اول تمام قدرت‌هاست.
        </p>
        <p>
            یکی از شخصیت‌های مهم کتاب مقدس موسی است. به عنوان رهبر قوم اسرائیل توسط خدا انتخاب شد تا قوم را از مصر بیرون کند و دستورات و فرامین الهی را از خدا دریافت کرد تا به مردم اسرائیل انتقال دهد و شخصیت‌های مهم دیگری نیز به عنوان رهبر مانند نوح، ابراهیم، اسحاق، یعقوب، داود بودند که خدا آنها را برگزید تا قوم را با دستورات و فرامین الهی هدایت کنند.
        </p>
        <p>
            در کتاب اول سموئیل می‌خوانیم خداوند سموئیل را صدا می‌زند (اول سموئیل 1:3-19). سموئیل اولین نبی است که خداوند او را فراخواند برای اصلاح و هدایت قوم اسرائیل.
        </p>
    </section>

    <section>
        <h2>توبیخ پادشاهان</h2>
        <p>
            همانطور که در مقدمه اشاره شد، خدا برای تربیت قوم و مردم در بیشتر مواقع پادشاهان را توسط انبیا توبیخ و تنبیه می‌کرد تا آنها به اشتباهات خود پی ببرند و به سوی فرمان‌های الهی بازگشت کنند.
        </p>
        <h3>توبیخ پادشاه آخاب</h3>
        <p>
            پادشاهی آخاب در زمان ایلیای نبی و الیشع بود. آخاب و همسرش ایزابل هر آن چیزی که از نظر خدا بد بود را انجام می‌دادند. آخاب به دلیل اعمال نادرست و گناهانی که در مقابل خداوند ارتکاب می‌کرد، آنها به وسیله تبعیض و ستم به مردم، خرابکاری در عبادت و پیروی از خدای بتان، و کشتن انبیا و پیروان خدا مرتکب گناه می‌شدند و توسط ایلیای نبی توبیخ شدند.
        </p>
    </section>

    <section>
        <h2>تشویق پادشاهان و مردم</h2>
        <p>
            در عهد عتیق انبیا پادشاهان را نیز تشویق می‌کردند. سموئیل و ناتان داود را به پیروی از خداوند و رفتار صالحانه تشویق کرده‌اند و یادآوری می‌کردند پادشاهی آنها انتخاب خداوند بوده و به پیروی فرمان‌های خداوند و عدالت و پرهیز از گناهان تشویق و هدایت می‌کردند.
        </p>
        <h3>تشویق اشعیا به پادشاهان</h3>
        <p>
            اشعیا نبی در تمام طول دوران حکومت پادشاهان مختلف در عهد عتیق تشویق و هدایت می‌کرد. مانند پادشاهانی که عبارتند از: عزیا، یوتام، آحاز، حزقیا. در زمان پادشاهی حزقیا در دوم پادشاهان باب 18 تهدیدهایی از سوی پادشاه آشور متوجه مردم یهودا شده بود و اشعیا نبی او را تشویق می‌کرد که نترسد و به خدا ایمان داشته باشد و به او توکل کنند.
        </p>
    </section>

    <section>
        <h2>نبوت انبیا</h2>
        <p>
            یکی دیگر از نقش‌های انبیا عهد عتیق نبوت بود. نبوت در اساسی‌ترین معنا پیام خداست و از این رو نبوت به معنای اعلام پیامی از جانب خداوند است.
        </p>
        <p>
            نبوت‌ها در عهد عتیق برای هدایت مردم به راه صحیح و انتخاب اعمال نیکو بکار می‌رفتند. انبیا به مردم اسرائیل شریعت خداوند را تعلیم می‌دادند و آنها را به رعایت دستورات الهی، اخلاق صالح و عبادت صحیح به اصلاح و توبه تشویق می‌کردند.
        </p>
    </section>
    

    
    `
  },
];

const FullArticle = () => {
  const { articleId } = useParams();
  const article = articles[articleId];

  if (!article) {
    return <h2>مقاله‌ای یافت نشد!</h2>;
  }

  return (
    <div className="full-article" dir="rtl">
      <h2>{article.title}</h2>
      <p className="author-date">
        <strong>نویسنده:</strong> {article.author} | <strong>تاریخ:</strong> {article.date}
      </p>
      <div className="article-content">
        {/* استفاده از dangerouslySetInnerHTML برای پردازش HTML در متن */}
        <p dangerouslySetInnerHTML={{ __html: article.content }} />
      </div>
      <Link to="/ArticlePage" className="back-link">بازگشت</Link>
    </div>
  );
};

export default FullArticle;
